package com.neyd.cookbook.util;

import com.neyd.cookbook.cookbook.CookBook;
import com.neyd.cookbook.cookbook.Recipe;

import java.util.*;

/**
 * генератор рецептів
 * Created by Zheka on 08.12.2015.
 */
public class RecipeGenerator {
    public static String[] nameOfRecipe = {
            "Тонкі млинці на сироватці",
            "Рулет із лаваша з сирною начинкою",
            "Салат з капусти з куркою і яєчними млинцями",
            "Салат з квасолею та печінкою",
            "Лінива шуба",
            "Мусака",
            "Лагман",
            "Картопля по-селянськи",
            "Запечена картопля",
            "Картопляні зрази",
            "Запечена картопля ",
            "Картопляні зрази з фаршем",
            "Деруни з фаршем",
            "Деруни з м'ясом",
            "Овочеве рагу з баклажанами",
            "Пісні деруни",
            "Смажена картопля",
            "Чіпси в мікрохвильовці",
            "Деруни картопляні",
            "Картопля в мікрохвильовці",
            "Картопляна запіканка з рибою",
            "Картопля по-селянськи",
            "Картопляні биточки з сиром і цибулею",
            "Деруни з овочами",
            "Фарширована картопля до Нового року",
            "Картопля фрі в духовці",
            "Деруни картопляні рецепт Жульєн по-домашньому",
            "Запечена картопля в духовці",
            "Картопля, запечена в панірувальних сухарях",
            "Картопляна запіканка під грибним соусом",
            "М'ясо з печерицями в сметані",
            "Свинина запечена шматком в духовці",
            "Помідори фаршировані фаршем з рисом",
            "Картопля з салом, запечена у фользі",
            "Тушкована картопля з м'ясом",
            "Відбивні зі свинини",
            "Стегенця курячі з картоплею в духовці",
            "Домашні пельмені",
            "М'ясні зрази з яйцем",
            "Макарони по-флотськи з тушонкою",
            "Реберця в кисло-солодкому соусі",
            "Свинина тушкована з гарбузом",
            "М'ясо по-королівськи",
            "Кордон блю з свинини",
            "Бефстроганов з свинини",
            "М'ясні рулети з грибами",
            "Буженина в домашніх умовах",
            "М'ясо по-французьки",
            "Рагу зі свинини",
            "Буженина запечена в тісті"
    };

    public static String[] description = {
            "Навіть при нетривалому зберіганні смак смаженого м’яса погіршується, тому смажити його слід незадовго до подавання. Перш ніж розігрівати на жиру вчорашнє смажене м’ясо, збризніть його трохи холодною водою. М’ясо збереже смак свіжо зажареного.",
            "Як визначити, чи добре просмажилось м’ясо? Добре просмажене м’ясо має рівномірне коричневе забарвлення і при натискуванні виділяє безбарвний сік.",
            "М’ясо при смаженні добре підрум’яниться, коли його обсушити на серветці.Для поліпшення смаку тушкованого м’яса використовують цибулю, моркву, петрушку. Загальна кількість приправ — не менш як 100 г на 1 кг м’яса.",
            "Хочете, щоб смажене м’ясо було соковитим? В такому разі перед подаею до столу чверть години потримайте його над каструлею з киплячою водою.",
            "М’ясо птиці буде ніжним і швидше звариться, якщо у воду влити столову ложку оцту.Кладіть котлети та шматки м’яса на добре розігріту з жиром сковороду, тоді сік не витікатиме з них.",
            "Кладіть котлети та шматки м’яса на добре розігріту з жиром сковороду, тоді сік не витікатиме з них.",
            "У багатьох господарок панірувальні сухарі, замість вкривати м’ясо золотистою, хрумкою скоринкою, залишаються на сковорідці. Правильне панірування полягає ось у чому: спочатку обкачують м’ясо у борошні, по\u00ADтім змазують його збитим яйцем, і лише після цього настане черга панірувальних сухарів.",
            "Хочете, щоб м’ясо тушкувалося якомога швидше? В такому разі додайте в соус томат-пюре, гранатовий сік або лимонну кислоту.",
            "Чим дрібніший шматок м’яса, тушка домашньої птиці, тим вищою має бути температура у духовці.",
            "Запам’ятайте дві закономірності: при варінні на слабкому вогні (коли вода кипить ледве помітно) смак вареного м’яса погіршується, а бульйону поліпшується, і навпаки, при сильному кипінні якість м’яса кра\u00ADща, а бульйону — гірша.",
            "Вироби з нежирного м’яса будуть соковиті й ніжні, якщо у фарш додати трошки здору і пропустити його крізь м’ясорубку разом з м’ясом.",
            "Як визначити якість м’яса? Доброякісне м’ясо вкрите тонкою блідо-рожевою або блідо-червоною кірочкою. При обмацуванні його поверхні рука лишається сухою.",
            "На розрізах м’ясо пе липне до пальців, сік прозорий. Ямки від натискання пальцем швидко зникають. Щоб визначити свіжість м’яса, треба проколоти його нагрітим ножем або виделкою: якщо воно не\u00ADдоброякісне, ніж або виделка матимуть неприємний запах.",
            "Для маринування м’яса можна використати оцет, сухе впно, ли\u00ADмон, ріпчасту цибулю, моркву, петрушку, з приправ —- чорний перець, сіль. М’ясо, занурене у маринад, рекомендується витримати на холоді кілька го\u00ADдин. Щоб маринад швидше проник у товщу м’яса і рівномірніше розподілив\u00ADся в ньому, куски м’яса треба проколоти в кількох місцях поварською голкою.",
            "М’ясо стане ароматнішим і соковитішим, якщо нашпигувати його корінням або свинячим салом.",
            "Щоб м’ясо не пригоріло і не стало сухим, поставте в духовку невелику відкриту посудину з водою.",
            "Сосиски під час варіння не будуть лопатись, якщо їх перед тим, як опустити в окріп, наколоти в кількох місцях виделкою.",
            "Сосиски і сардельки звичайно запарюють окропом. Але набагато смачнішими вони будуть, коли їх зігріти на парі або трохи підсмажити.",
            "Підсолений окіст перш ніж коптити вимочіть протягом 2—5 годин у холодній воді. Потім підвісьте окіст на 2—3 години у прохолодному місці і лише після цього вміщуйте його у коптильню.",
            "Якщо згодом окіст будете варити, то коптіть гарячим способом протягом 10 годин при температурі диму .40—45°. Тривалість варіння окосту залежить від його розміру — на кожний кілограм треба 40—50 хвилин.",
            "Легкий наліт сухої плісняви па твердокопченій ковбасі не вважає\u00ADться вадою. Щоб видалити його, ковбасу треба протерти сухою чистою тканиною з сіллю.",
            "Картопля, запечена часточками в духовці, стане не тільки відмінним прикрасою для будь-якого обіднього столу, але і послужить ситної закускою.",
            "Сформувавши блюдо так, як було описано вище, його необхідно помістити в духовку і готувати при температурі 210 градусів близько години. За цей час овоч стане повністю м'яким і навіть трохи підсмажиться. Щоб зробити цю страву ще смачніше, за 1/4 години до вимкнення духовки картоплю рекомендується рясно обсипати натертим сиром."
    };

    public static String[] product = {
            "Яйця",
            "Буряк",
            "Цибуля",
            "Майонез",
            "Огірки",
            "Морква",
            "Квасоля",
            "Молоко",
            "Куряче філе",
            "Капуста",
            "Сир",
            "Часник",
            "Цукор",
            "Сіль",
            "Борошно",
            "Олія",
            "Перець",
            "Вода",
            "Курячі стегенця",
            "Свіжоморожена риба",
            "Яблука",
            "Банани",
            "Апельсини",
            "Лимони",
            "Кефір",
            "Молоко",
            "Сметана",
            "Сир твердий",
            "Сир плавлений",
            "Тушонка",
            "Горошок",
            "Кукурудза",
            "Згущене молоко",
            "Гриби",
            "Свинина",
            "Яловичина",
            "Гречка",
            "Перловка",
            "Рис",
            "Геркулес",
            "Кукурудзяна крупа",
            "Горох",
            "Томат",
            "Гірчиця",
            "Мед",
            "Рослинна олія",
            "Оцет",
            "Маргарин",
            "Дріжджі",
            "Сода",
            "Лавровий лист",
            "Какао"

    };

    public RecipeGenerator() {
    }

    public static List<Recipe> fillCookBook(int count) {
        Random random = new Random();
        List<Recipe> recipes = new ArrayList<Recipe>();
        if (count >= nameOfRecipe.length) {
            count = nameOfRecipe.length;
        }
        for (int i = 0; i < count; i++) {
            recipes.add(
                    new Recipe().setName(nameOfRecipe[i]).
                            setDescription(description[random.nextInt(description.length)]).
                            addProduct(product[random.nextInt(product.length)]).
                            addProduct(product[random.nextInt(product.length)]).
                            addProduct(product[random.nextInt(product.length)]).
                            addProduct(product[random.nextInt(product.length)])
            );
        }
        return recipes;
    }
}
